Tekla Open API Reference for Tekla Structures 2025
PolyLine Properties
The PolyLine type exposes the following members.
Properties
Name | Description
Points
 The points the polyline consists of.
Top
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace